### Prepared by Abhishek Kumar
### https://www.linkedin.com/in/abhishek-kumar-442337b2/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# To get multiple outputs in the same cell

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

%matplotlib inline

In [3]:
# Setup : DataFrame creation

salary = [['1','Abhishek Kumar','AIML', 'Machine Learning Engineer','M', 'Y', '04051990', 1121000],
          ['2','Arjun Kumar','DM', 'Tech Lead','M', 'Y', '09031992', 109000],
          ['3','Vivek Raj','DM', 'Devops Engineer','M', 'N', np.NaN , 827000],
          ['4','Mika Singh','DM', 'Data Analyst','F', 'Y', '15101991',  np.NaN],
          ['5','Anusha Yenduri','AIML', 'Data Scientist','F', 'Y', '01011989',  921000],
          ['6','Ritesh Srivastava','AIML', 'Data Engineer','M', 'Y', np.NaN, 785000]]

columns_name=['Emp_Id','Emp_Name','Department','Role','Gender', 'WFH Status', 'DOB', 'Salary']

emp_df = pd.DataFrame(salary,columns=columns_name)
emp_df

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

# 1. Group By: Split-Apply-Combine


    i. df.groupby()
    ii. .apply() , .agg(), .filter()
    iii.

In [4]:
emp_df_1 = emp_df.copy()
emp_df_1

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [5]:
grouped_1 = emp_df_1.groupby('Department')
grouped_1

## 1.1 Meta Methods

    Meta methods are less concerned with the original object on which .groupby() is called.
    Mainly provide high-level information such as the number of groups and indices of those groups.

In [6]:
grouped_1.groups

{'AIML': Int64Index([0, 4, 5], dtype='int64'),
 'DM': Int64Index([1, 2, 3], dtype='int64')}

In [7]:
grouped_1.get_group('DM')

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN

In [8]:
grouped_1.indices

{'AIML': array([0, 4, 5], dtype=int64), 'DM': array([1, 2, 3], dtype=int64)}

In [9]:
grouped_1.ndim

2

In [10]:
grouped_1.ngroups

2

In [11]:
grouped_1.ngroup()

0    0
1    1
2    1
3    1
4    0
5    0
dtype: int64

In [12]:
grouped_1.dtypes

            Emp_Id Emp_Name    Role  Gender WFH Status     DOB   Salary
Department
AIML        object   object  object  object     object  object  float64
DM          object   object  object  object     object  object  float64

In [13]:
#for i in range(2):
#    grouped_1.__iter__()

## 1.2 Filter Methods

    Filter methods return a subset of the original DataFrame. 
    Most common is .filter() to drop entire groups based on some comparative statistic about that group and its sub-table. 
    There are a number of methods that exclude particular rows from each group.

In [14]:
grouped_1.first()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0

In [15]:
grouped_1.last()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,01011989,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,827000.0

In [16]:
grouped_1.head(2)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0

In [17]:
grouped_1.tail(1)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [18]:
# Take the nth row from each group if n is an int, or a subset of rows if n is a list of ints.

grouped_1.nth(2)

grouped_1.nth([0,2])

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

In [19]:
# we are selecting the 0th and 2nd rows, not rows whose indices equal 0 and 2.

grouped_1.take([0,2])

             Emp_Id           Emp_Name                       Role Gender  \
Department
AIML       0      1     Abhishek Kumar  Machine Learning Engineer      M
           5      6  Ritesh Srivastava              Data Engineer      M
DM         1      2        Arjun Kumar                  Tech Lead      M
           3      4         Mika Singh               Data Analyst      F

             WFH Status       DOB     Salary
Department
AIML       0          Y  04051990  1121000.0
           5          Y       NaN   785000.0
DM         1          Y  09031992   109000.0
           3          Y  15101991        NaN

In [25]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_1.filter(lambda x: len(x['Emp_Id']) >= 3)

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0

In [26]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_1.filter(lambda x: sum(x['Salary']) >= 950000)

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
4,5,Anusha Yenduri,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0

In [22]:
grouped_2 = emp_df_1.groupby(['Department','Role'])
grouped_2

In [23]:
grouped_3 = emp_df_1.groupby(level = 0)
grouped_3

In [24]:
grouped_2 = emp_df_1.groupby('Department', axis = 1)
grouped_2